import TermsType from './terms-type';

export const YOUTH_PROTECTION: TermsType[] = [
  {
    id: '1',
    content: [
      {
        text: '"동방"(이하 "회사")은 각종 청소년 유해 정보로부터 청소년을 보호하고, 청소년의 건전한 성장을 돕기 위해 관련 법령에 근거하여 다음과 같은 청소년 보호정책을 시행하고 있습니다.',
        bold: false,
      },
    ],
  },
  {
    id: '2',
    title: '제 1 조 (청소년 보호를 위한 목표 및 원칙)',
    content: [
      {
        text: '회사는 청소년이 정신적·신체적으로 유해한 환경으로부터 보호받으며 건전하게 서비스를 이용할 수 있도록 ',
        bold: false,
      },
      { text: '유해 정보에 대한 차단 및 관리 조치', bold: true },
      { text: '를 취합니다.', bold: false },
    ],
  },
  {
    id: '3',
    title: '제 2 조 (유해 정보에 대한 업무 수행 및 관리 조치)',
    content: [
      { text: '회사는 청소년 유해 정보로 인한 피해를 예방하기 위해 다음과 같은 조치를 취합니다.\n', bold: false },
      { text: '1. 유해 정보 모니터링 및 차단 :', bold: true },
      {
        text: ' 청소년에게 유해한 키워드, 이미지, 동영상 등이 포함된 게시물이 동아리 피드 및 채팅 내에 유통되지 않도록 상시 모니터링을 수행합니다.\n',
        bold: false,
      },
      { text: '2. 신고 기능 운영 :', bold: true },
      {
        text: ' 이용자가 유해 정보를 발견했을 때 즉시 신고할 수 있는 기능을 제공하며, 신고된 게시물은 즉시 검토 후 삭제 또는 접근 제한 조치를 취합니다.',
        bold: false,
      },
    ],
  },
  {
    id: '4',
    title: '제 3 조 (유해 정보로부터의 청소년 보호를 위한 교육)',
    content: [
      {
        text: '회사는 청소년 보호 책임자 및 서비스 운영자를 대상으로 청소년 보호 법령 및 유해 정보 발견 시 대처 방법 등에 관한 교육을 실시합니다.',
        bold: false,
      },
    ],
  },
  {
    id: '5',
    title: '제 4 조 (청소년 유해 정보로 인한 피해 상담 및 고충 처리)',
    content: [
      {
        text: '회사는 청소년 유해 정보로 인한 피해 상담 및 고충 처리를 위해 전문 인력을 배치하거나 관련 기관과의 협력을 통해 피해가 확산되지 않도록 노력합니다.',
        bold: false,
      },
    ],
  },
  {
    id: '6',
    title: '제 5 조 (청소년 보호 책임자)',
    content: [
      {
        text: '회사는 청소년 보호와 관련한 이용자의 의견을 수렴하고 문제를 해결하기 위해 아래와 같이 청소년 보호 책임자를 지정합니다.\n',
        bold: false,
      },
      { text: '• 성명 : 근위호\n• 직책 : 대표\n• 연락처 : dongaribang25@gmail.com', bold: true },
    ],
  },
  {
    id: '7',
    title: '부칙<2025년 12월 19일>',
    content: [{ text: '(시행일)본 정책은 2025년 12월 19일부터 시행합니다.', bold: true }],
  },
];
